Revit 2027 API
InvalidOperationException Class
The exception that is thrown when a method call is invalid for the object's current state.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 More
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class InvalidOperationException : ApplicationException
<SerializableAttribute>
Public Class InvalidOperationException
	Inherits ApplicationException
[SerializableAttribute]
public ref class InvalidOperationException : public ApplicationException
[<SerializableAttribute>]
type InvalidOperationException =
    class
        inherit ApplicationException
    end
The InvalidOperationException type exposes the following members.
Properties
Name | Description
Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.
(Inherited from Exception)
FunctionId | The information of the function throwing the exception.
(Inherited from ApplicationException)
HelpLink | Gets or sets a link to the help file associated with this exception.
(Inherited from Exception)
HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.
(Inherited from Exception)
InnerException | Gets the Exception instance that caused the current exception.
(Inherited from Exception)
Message | Gets a message that describes the current exception.
(Inherited from Exception)
Source | Gets or sets the name of the application or the object that causes the error.
(Inherited from Exception)
StackTrace | Gets a string representation of the immediate frames on the call stack.
(Inherited from Exception)
TargetSite | Gets the method that throws the current exception.
(Inherited from Exception)
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.
(Inherited from Exception)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides ApplicationException.GetObjectData(SerializationInfo, StreamingContext))
GetType | Gets the runtime type of the current instance.
(Inherited from Exception)
ToString | Creates and returns a string representation of the current exception.
(Inherited from Exception)
Top
See Also
Reference
Autodesk.Revit.Exceptions Namespace
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.AutoJoinFailedException
 Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException
 Autodesk.Revit.Exceptions.DefaultValueException
 Autodesk.Revit.Exceptions.DisabledDisciplineException
 Autodesk.Revit.Exceptions.FamilyContextException
 Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
 Autodesk.Revit.Exceptions.InapplicableDataException
 Autodesk.Revit.Exceptions.InsufficientResourcesException
 Autodesk.Revit.Exceptions.InvalidObjectException
 Autodesk.Revit.Exceptions.ModificationForbiddenException
 Autodesk.Revit.Exceptions.ModificationOutsideTransactionException
 Autodesk.Revit.Exceptions.NotTransmittedModelException
 Autodesk.Revit.Exceptions.ObjectAccessException
 Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException
 Autodesk.Revit.Exceptions.RegenerationFailedException
 Autodesk.Revit.Exceptions.SchemaException
 Autodesk.Revit.Exceptions.TransientElementCreationException
 Autodesk.Revit.Exceptions.TransmittedModelException
 Autodesk.Revit.Exceptions.WrongUserException